# GetOrderedParameters Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Element..::..GetOrderedParameters Method
Element Class See Also
---
Gets the parameters associated to the element in order.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public IList<Parameter> GetOrderedParameters()
```

Visual Basic
---
```text
Public Function GetOrderedParameters As IList(Of Parameter)
```

Visual C++
---
```text
public:
IList<Parameter^>^ GetOrderedParameters()
```

# ### Return Value
A collection containing all parameters.
# Remarks
The collection consists of only visible parameters associated to the element; it returns a different list than Element.Parameters.
The parameters are returned in the order in which they appear in the Revit UI within a given group; however, parameters of different groups may be mixed within this output.
Currently the Revit UI order is determined first by group and next by the order of the individual parameters.
# See Also
Element Class
Autodesk.Revit.DB Namespace